tap "beeftornado/rmtree"
tap "homebrew/bundle"
tap "homebrew/core"
tap "linuxbrew/xorg"
tap "mutagen-io/mutagen"
# Automatic configure script builder
brew "autoconf"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Cross-platform make
brew "cmake"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# GNOME XML library
brew "libxml2"
# Load/unload environment variables based on $PWD
brew "direnv"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU Compiler Collection
brew "gcc@5"
# Alternative to top/htop
brew "glances"
# Improved top (interactive process viewer)
brew "htop"
# Add GitHub support to git on the command-line
brew "hub"
# Improved colored diff
brew "icdiff"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Cross-shell prompt for astronauts
brew "starship"
# Watch files and take action when they change
brew "watchman"
# Fast file synchronization and network forwarding for remote development
brew "mutagen-io/mutagen/mutagen-beta"
