tap "coder/coder"
tap "hashicorp/tap"
tap "gromgit/fuse"
tap "indigoviolet/tap", "git@github.com:indigoviolet/homebrew-tap.git"
tap "noborus/tap"
tap "pulumi/tap"
tap "treeverse/lakefs"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# Utility for connecting securely to your Cloud SQL instances
brew "cloud-sql-proxy"
# Tool for provisioning self-hosted development environments with Terraform
brew "coder"
# Reference implementation for the Development Containers specification
brew "devcontainer"
# Visually compare two PDF files
brew "diff-pdf"
# Command-line tool (and API) for diffing Excel Workbooks
brew "excel-compare"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Kubernetes package manager
brew "helm"
# Lightweight PDF and XPS viewer
brew "mupdf"
# Execute SQL to xlsx and convert to other format
brew "noborus/tap/xlsxsql"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Cloud native development platform
brew "pulumi"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Rsync for cloud storage
brew "rclone"
# Rsync for cloud storage (with macOS FUSE mount support)
brew "gromgit/fuse/rclone-mac"
# Terraform
brew "hashicorp/tap/terraform"
# CLI tool to upload CSV to Google Sheets
brew "indigoviolet/tap/gsheet"
# lakeFS is an open-source tool that transforms your object storage into a Git-like repository.
brew "treeverse/lakefs/lakefs"
vscode "alefragnani.bookmarks"
vscode "anthropic.claude-code"
vscode "anysphere.cursorpyright"
vscode "anysphere.remote-containers"
vscode "anysphere.remote-ssh"
vscode "bazelbuild.vscode-bazel"
vscode "bodil.file-browser"
vscode "bradlc.vscode-tailwindcss"
vscode "buenon.scratchpads"
vscode "charliermarsh.ruff"
vscode "coder.coder-remote"
vscode "codezombiech.gitignore"
vscode "congyiwu.vscode-jupytext"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "donjayamanne.vscode-default-python-kernel"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "f-loat.jsonl-converter"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "grapecity.gc-excelviewer"
vscode "graphite.gti-vscode"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-test-explorer"
vscode "iliazeus.vscode-ansi"
vscode "jakearl.search-editor-apply-changes"
vscode "johnpapa.vscode-peacock"
vscode "kahole.magit"
vscode "kevinghadyani.vscode-colormate"
vscode "kokakiwi.vscode-just"
vscode "kriegalex.vscode-cudacpp"
vscode "letmaik.git-tree-compare"
vscode "linear.linear-connect"
vscode "littlefoxteam.vscode-python-test-adapter"
vscode "matangover.mypy"
vscode "mathiasfrohlich.kotlin"
vscode "matthewnespor.vscode-color-identifiers-mode"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "mkhl.direnv"
vscode "mohammadbaqer.better-folding"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-playwright.playwright"
vscode "ms-pyright.pyright"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-powertoys"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "nefrob.vscode-just-syntax"
vscode "nick-rudenko.back-n-forth"
vscode "njpwerner.autodocstring"
vscode "randomfractalsinc.vscode-data-preview"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ryuta46.multi-command"
vscode "semanticdiff.semanticdiff"
vscode "skellock.just"
vscode "slbtty.lisp-syntax"
vscode "stkb.rewrap"
vscode "streetsidesoftware.code-spell-checker"
vscode "strigo.linear"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "tuttieee.emacs-mcx"
vscode "usernamehw.errorlens"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-org-mode.org-mode"
vscode "wholroyd.jinja"
vscode "yasukotelin.toggle-panel"
vscode "zainchen.json"
